package com.yzt.logic.util;

import java.net.URLEncoder;

/**
 * 
 * @Title:  CommonUtil     
 * @Description:    TODO  
 * @author: zc    
 * @date:   2018年1月29日 上午11:38:15   
 * @version V1.0 
 * @Copyright: 2018 云智通 All rights reserved.
 */
public class CommonUtil {

    public static String[] names= new String[]{"孛晋鹏","曹幼珊","扶春晓","拜素昕","匡健柏","银天华","次孤阳","海兴发","钭旭鹏","少高朗","高梦山","咎艳卉","魏迎夏","员雅霜","友香菱","苍友易","邵幻翠","尾之云","寇方仪","狂饮香","帛清昶","谈寄春","厍夜春","逯访风","万俟皓君","养秋灵","剑修筠","查天材","璩靖巧","巴乐悦","巧玉宇","释幼丝","介寻芳","逮弘方","绳希彤","禾靖易","集静曼","励向笛","侯浩歌","齐寒雁","赤勇毅","门鸿波","常寄瑶","秘流逸","夕承平","周乐然","禚乃心","百依霜","崇映寒","邓冬梅","森白亦","蹉丰茂","代醉易","线白风","碧晴霞","板天薇","仲孙春妤","纵平文","解白竹","饶笑容","肥灵松","太叔觅荷","平水悦","陆希月","糜思恩","寸依楠","桐梦竹","巫慧英","类笑笑","之勇军","游向松","夙霞雰","忻宏旷","农令怡","牧欣愉","竭清婉","哀绿夏","酆辰宇","段和正","波初阳","阙星海","微生初然","张简南晴","王凡雁","佟华婉","仝兰蕙","仪雅洁","於乐安","管斌蔚","祝翠阳","须夜天","叔飞兰","奚彩静","孝玉兰","辉骏喆","薄古香","褚又蓝","赏海秋","羽傲安","孔书雁","德灵寒","金文景","敖清宁","摩慧颖","居河灵","钮寻梅","允琪华","甲代芹","笃芝兰","苟秀敏","欧阳艳娇","碧鲁雁菱","老小翠","答可佳","藏夏真","凤凌雪","尹才英","束双玉","蓟浩涆","塞闳丽","松攸然","司马浩瀚","彭琇芬","娄初蝶","喻雨文","双俊雅","资星波","凭曜文","声春海","歧逸明","雷忆安","宰醉冬","刘凝思","裔迎南","不芮波","瓮新荣","肖娟娟","衅明轩","莱向阳","谌晶辉","慎子爱","衡智敏","丁水芸","荀如冰","象思洁","粟觅松","藩亦绿","景采萱","旁骊燕","姜贝丽","禽秋柔","霜雪萍","扬昂雄","勇初夏","印绿蕊","单于乐游","明兴邦","却庄丽","其灵秋","蛮昊穹","司寇鸿飞","贡碧蓉","伏白柏","无雪冰","梁采文","庚晨钰","卑飞驰","曲访曼","始俊名","言静雅","夷梓涵","聂妙珍","贝建华","佟佳傲冬","夔飞语","丰俊艾","诸葛听春","龙白玉","那拉寻桃","井旎旎","诸清韵","嘉天空","郗绢子","崔婉静","中颀秀","宇涵涵","皋翰海","撒嘉美","九易梦","续怀曼","叶晴霞","莘骊茹","丘语蝶","敛红云","杜元旋","公西雅旋","太史山雁","潮采南","程兴业","宁梓蓓","寒恨桃","庆嘉月","翦含蕊","圣怜云","春巧香","淳于冷珍","将曾琪","豆升荣","宋怀山","空思雨","卞琲瓃","谬隽巧","赛逸思","綦和平","沃梓柔","千忆枫","戎兰若","历冬菱","乜晗昱","繁梦易","书曼安","汤飞珍","卫和璧","和梦寒","乌静涵","六颐然","訾香芹","乾恬雅","招嘉祥","寿慕雁","毕嘉懿","悉思真","乌孙佳悦","嬴冬卉","卓子石","树晗雨","安雨兰","严茂才","隐晴丽","马昆雄","羊贝莉","麴雨星","国妙芙","旷晴照","狄晴雪","敬尔容","秋英悟","茅语山","韩智敏","蹇旻骞","徐寄蓝","钟离雨灵","彤新立","翠沙羽","计青文","任谷梦","涂温瑜","尔芳馥","咸星晴","慕寄松","刀妙梦","邰嘉运","仉正阳","闻人亦旋","法同和","频和顺","舒语诗","越光临","郏香雪","敏令羽","江婷玉","良运乾","臧玉韵","鱼雨琴","威白薇","问致萱","禄代卉","仇正业","宇文书竹","归依云","冒雅晗","宝同济","从依柔","邹弘盛","萨亦竹","来韵磬","漆安双","殳诗兰","贾浩言","易迎夏","公孙紫安","缑乐儿","茆友桃","掌慕卉","乙晨轩","隆冰彦","昝姮娥","边建元","贲灵萱","澹台沛凝","谏春柏","宾友琴","西门嘉淑","强友灵","鲍秋莲","刚嘉致","戏奇正","靖良策","水乐童","姬丹红","弓慧巧","休丽泽","买寻春","完紫菱","乌雅星文","苌元芹","仲建章","封巍昂","左新苗","睢洁玉","荆安平","帅智美","屈弘济","冀欣然","施秀兰","典从云","望天骄","楚梅红","时悦欣","疏宏远","寻瑰玮","百里绮露","位碧曼","操芳林","项云霞","官晨希","种凡桃","苏元德","接文宣","祢若兰","章佳筠溪","光长菁","姚海冬","泣惠君","闫梦露","闾丘佳惠","充晨璐","颛孙文康","骑承宣","表丹寒","盈雅韶","简初雪","裘智鑫","浑曼青","虢灵槐","墨博涉","翁梦凡","铎乐松","广痴灵","后采梦","富娴雅","五梦兰","邴忻慕","清幻桃","泰世韵","泥奇伟","驹昌燎","祈诗珊","雍浩皛","蓝倩美","岳灵秀","廉琳芳","佼春华","蓬春燕","公叔朵儿","连初柳","植雨信","终欢悦","瞿灵韵","杭妙松","汉建同","南门鸿彩","暴秀媚","耿英范","公嘉悦","侍紫雪","改白夏","运俊誉","闾念露","闽醉巧","朴蕴秀","竺冠玉","世丹秋","席飞宇","腾安珊","晋从蕾","由绮梅","宏妍妍","罕之桃","司春娇","童云天","硕皎洁","绍韫玉","实悦心","冯忆之","壤驷婉丽","郑贤惠","说醉卉","兰曼云","滕依秋","都流惠","永欣悦","籍沛文","折浩波","麻成业","扈晴霞","士水晶","颜芷兰","班清芬","出悦远","呼延曼珍","樊阳曦","商宏畅","呼芮优","夹谷兰娜","止淳雅","宛曼衍","圭清卓","箕傲柏","委惜筠","伦昊英","萧念文","祖涵亮","桂新晴","鹿宜春","蒯曼蔓","愈奇文","速痴海","信以彤","京素欣","山子帆","邬自明","理醉易","巨飞航","韦胤雅","苦梓莹","康璇玑","勤雪羽","星俊弼","皮和煦","昌炫明","军宛儿","储炎彬","召静姝","麦苑杰","方香桃","巢千雁","端木念文","琦兰芝","桓曼珠","兴安梦","有安祯","修诗蕾","泷骏俊","载安静","善子菡","学金枝","汪梓璐","夏元甲","杞晓星","字宜嘉","东郭玄清","展冰双","洋盈盈","廖含娇","台又香","禹蓝尹","闭新竹","隽书桃","赫绮思","步鹏运","倪秀艳","姒俊远","前若薇","苗新烟","淡睿德","伯天蓝","脱飞丹","迟雪巧","伍晴丽","冷夏柳","迮子萱","亓曼文","区明俊","公良怀莲","所戈雅","进曼云","么寒梦","公羊芳蕙","雪嘉泽","受惜蕊","吕友安","贰翠荷","伊经国","仵兴朝","丹冷荷","孟嘉禧","盛晴雪","弭易蓉","季湛娟","督雪翎","年明明","许欣美","乘沛白","肇世英","贺洁玉","矫痴凝","刑慧君","米月华","守雨晴","吴珺琪","功轶丽","奇文昂","温春蕾","纳喇红豆","鄞彭泽","错开宇","戴小蕊","考海秋","宗政迎彤","端凌文","旅凌柏","南水荷","顾立诚","定晗晗","皇芊芊","辜绮南","回晗昱","邢芮丽","闳星阑","纪冬萱","于浩大","沈雅琴","诺沛文","缪碧蓉","栗清漪","库鸿畅","苑思山","逢鸿光","霍子舒","牛昊然","节敏达","陈承业","浮兴贤","戊迎夏","邝流婉","令烨赫","壬凝丹","羿辰钊","检沈静","尉姝美","延雅韵","蔡嘉珍","花怀芹","濮阳光济","濯映寒","白靖易","谭迎真","后锦欣","熊寻绿","牢慧智","妫丹萱","图门瑛琭","蒙安容","抄高轩","飞秋寒","申屠涵润","师盼盼","林嘉颖","全俏美","局小楠","悟绿兰","申谷兰","滑清涵","佘鹏池","抗德曜","东门淳美","云涵畅","戚华藏","闪绮美","恭安宜","辟紫桐","示抒怀","菅兴为","勾明诚","危梦华","达雨伯","田童童","卷夏青","登锐阵","郯古兰","宫谷蕊","青曼容","潜月悦","甫绿凝","力承泽","邱涵容","家幻翠","柔春枫","卢秀颖","鄢芮雅","奈妙之","符晟睿","仙悦喜","洛向槐","通英才","酒雨竹","融元纬","眭春翠","奉若雁","堂寄灵","冠友槐","机玲玲","原博敏","骆寄蕾","宓晋鹏","辛璇娟","洪思雁","雀清华","刁静珊","诗朝雨","谯兴腾","夏侯文乐","性文思","徭雪卉","韶芮安","磨怡和","母和惬","能清怡","礼清芬","城凝荷","隗弘量","生慕凝","丙怜云","己阳成","索音景","岑望舒","上官舒扬","栋俊彦","公冶夏柳","户傲云","袁浩慨","锁含秀","枚千柔","才瀚文","营菀菀","斯傲菡","栾谷秋","候怜晴","保晴虹","毋白枫","朱长运","伟昊苍","万翠丝","宜含巧","僧国安","业鸿祯","巩家美","过元正","费骞泽","暨雅唱","衷书君","富察囡囡","贸鸿朗","褒永长","建瑶岑","权芮静","濮英武","向羡丽","钦雁卉","宰父代巧","紫荌荌","孙曼妮","沙梅青","甄夜卉","多怡悦","果承颜","慕容阳曦","锐正奇","素坚壁","仆诗蕊","仰飞昂","蒉白莲","兆嘉禾","裴沛容","茹慧晨","义子明","昔文轩","华芷蓝","湛杉月","黎书萱","杨幻儿","成文茵","亥晓楠","可晗日","甘德水","依芸溪","度正思","车雁易","穆桂月","朋晓山","益怡乐","战丁辰","惠颖初","府逸美","范姜欣跃","邛秋英","柴霞辉","真恩霈","谷梁紫薇","第五念霜","鲁静美","潘芳洁","阚映萱","吾景澄","郦欣彤","本雁露","邸海之","弥锐利","蒋南露","赧祺然","卿恨之","卜睿达","环文瑞","莫永怡","陶元容","秦修齐","纳悦爱","余恬欣","昂晨星","俞振凯","艾云韶","以乐双","天高义","溥惜香","牟新语","牵秀妮","利颖慧","虞博耘","税月怡","翟从灵","告依白","郁鸿畴","完颜雅霜","薛雯华","姓欣欣","势雪瑶","道凯乐","邶惜萍","合鸿振","钟宾鸿","沐芷烟","浦海桃","唐秀雅","遇颖然","覃木兰","戢浩岚","况秋双","焦若骞","斋婉然","范问凝","檀绿海","罗昆鹏","行弘新","笪雪珍","蒿桃雨","柯鸿振","希嘉玉","粘半蕾","鞠夏柳","坚凝珍","梁丘青易","段干新洁","琴碧春","化冰菱","慈新蕾","殷翠绿","及蕴和","剧凝莲","系慧艳","庾夏之","仁茂学","劳若云","零灵萱","阮希蓉","赫连湛蓝","睦雨旋","荣冉冉","房依白","马佳德运","芒和暖","智向荣","亢诗珊","包丹亦","郎子琪","胡锐立","御南霜","旗弘雅","盘雅娴","胥天韵","初笑晴","董采枫","张伟祺","市清奇","梅昊焱","用驰皓","庞沛柔","燕思琪","占傲菡","俟从蕾","屠鹏鲲","念莹然","开心香","恽浩邈","子车梓珊","独阳波","幸雁芙","謇清悦","律白玉","弘新月","晏奇思","闻慕蕊","偶丹亦","让文曜","曾问玉","党雪莲","逄霞飞","满尔阳","瑞忆安","捷阳朔","鄂高明","陀白梦","貊乐怡","阎安白","斛浦泽","鲜于巧夏","楼霏霏","蔚琛丽","窦成双","仍小霜","柳芳洲","皇甫文丽","阿怀蕾","镇星火","函华芝","钱歌阑","芮友安","揭嘉誉","荤天纵","乔和志","玄颖慧","练雪晴","析婉秀","习玉怡","丑从安","柏英朗","丛安民","漆雕忆彤","傅俊良","镜蕊珠","竹喜悦","藤绍祺","黄英华","乐正美丽","古初露","宦映菱","汗运虹","靳华采","僪秋柔","费莫念云","烟芷荷","堵曼青","布顺美","似梓敏","令狐含双","务尔槐","晁天心","英念蕾"};
    public static String[] imgs = {
            "http://img3.imgtn.bdimg.com/it/u=2689938761,2277662480&fm=28&gp=0.jpg",
            "http://wanzao2.b0.upaiyun.com/system/pictures/33318987/original/1455848497_813x533.png",
            "http://wanzao2.b0.upaiyun.com/system/pictures/24768446/original/8a0a97828f60f297.png",
            "http://tupian.enterdesk.com/uploadfile/2013/0712/20130712113411175.jpg",
            "http://wanzao2.b0.upaiyun.com/system/pictures/28181125/original/1440854548_500x513.png",
            "http://wanzao2.b0.upaiyun.com/system/pictures/30014877/original/1445677802_500x500.png",
            "http://img4.imgtn.bdimg.com/it/u=2102141248,2501957051&fm=214&gp=0.jpg",
            "http://wanzao2.b0.upaiyun.com/system/pictures/29574913/original/f111dd71d7f8706c.png",
            "http://wanzao2.b0.upaiyun.com/system/pictures/30021557/original/1445686654_500x500.png"
            ,
            "http://www.cnlogo8.com/d/file/2017-08-17/3426f1098fa3105b7dd9192d1f417e2b.png",
            "http://www.cnlogo8.com/d/file/2014-03-06/353526811ca990e8a811b883ab00b287.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/7a7868b29004db19ab96e1d97dda1d63.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/cac9c51d516ff5c65d06ec0202f45b80.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/d770d5dcdd39198c5de8adc1d9c823e3.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/cb8117fa91e5f8751ff4e4853bbb484a.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/c060e87de025d5b533a0676e43059ab8.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/9310536a117a384ac4918e0491e00267.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/50fa97ac38c4ef9733ead18fb3812670.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/8b545fe71b0838f920096e3c364001cf.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/0f9ae307e4fe7264a3418b48ca946a8d.jpg",
            "http://www.cnlogo8.com/d/file/2014-03-06/9da37fc27a7086f311fc5279ee5cc815.jpg",
            "http://www.cnlogo8.com/upimg/userup/0807/1011563O3E.jpg",
            "http://www.cnlogo8.com/upimg/userup/0807/1011562E612.jpg",
            "http://www.cnlogo8.com/upimg/userup/0807/101156161617.jpg",
            "http://www.cnlogo8.com/upimg/userup/0807/10115605Q44.jpg"
            
    };

    /**
     * 传入位数，返回相应位数的随机数
     * 2-9位以内随机数
     * @param num
     * @return
     */
    public static Integer getGivenRamdonNum(int num){
        //int 最大2147483647，为10位，所以必须在10为以内
        if (num<=1||num>=10){
            return 0;
        }
        int num1 = (int)Math.pow(10d,Double.parseDouble(num+""));
        int num2 = (int)Math.pow(10d,Double.parseDouble((num-1)+""));
        return (int)(Math.random()*(num1-num2))+num2;
    }

    /**
     * 获取传入数字num以内(0-（num-1）)的随机数
     * @param num
     * @return
     */
    public static Integer getRamdonInNum(int num){
        return (int)(Math.random()*num);
    }


    public static void main(String[] args) throws Exception{
        for (int i=0;i<16;i++){
        	System.out.println(URLEncoder.encode(CommonUtil.names[CommonUtil.getRamdonInNum(names.length)],"UTF-8"));
//            System.out.println(CommonUtil.imgs[CommonUtil.getRamdonInNum(imgs.length)]);
//            System.out.println(new Date().getTime());
        }
    }
    
    
    private static final char z = '{';
    private static final char y = '}';
    
    public static int getLastIndex(String dd){
		int zuoNum = 0;
        int lastIndex = 0;
        boolean flag = true;
        for(int i=0;i<dd.length();i++){
        	if (z == dd.charAt(i)) {
        		if (flag) {
        			zuoNum++;
				}
			}else if(y == dd.charAt(i)) {
				if (zuoNum>0) {
					zuoNum--;
					flag = false;
					if (zuoNum==0) {
	        			lastIndex = i;
	        			break;
					}
				}else{
					break;
				}
			}
        }
//        int temp = zuoNum;
//        while (true) {
//        	for(int i=0;i<dd.length();i++){
//            	if (y == dd.charAt(i)) {
//            		zuoNum--;
//            		if (zuoNum==0) {
//            			lastIndex = i;
//            			break;
//    				}
//    			}
//            }
//        	if (lastIndex!=0) {
//				break;
//			}else{
//				zuoNum = temp - 1;
//			}
//		}
        return lastIndex;
	}
    
    
}
